const { getAllHomes, addHome } = require("./connectDB")


const homeData = [
{
    name: "Гуртожиток №1",
    floors: 5,
    system: "коридорна",
    description: `
      На кожному поверсі розташовані 2 кухні, 2 санвузли.
      На першому поверсі знаходяться кабінети завідувача гуртожитку, адміністрації студентського містечка та пральна кімната.
      У гуртожитку проживають студенти факультету комп’ютерних інформаціних технологій та сімейні працівники університету.
    `,
    adress: "м. Тернопіль, вул. Львівська, 1"
},
{
    name: "Гуртожиток №2",
    floors: 5,
    system: "блочна",
    description: `
      На кожному поверсі 2 кухні та блоки, що складаються з двох кімнат, коридору та санвузла.
      На першому поверсі знаходиться кабінет завідувача гуртожитку, просторий вестибюль та відділ художньої літератури бібліотеки ЗУНУ.
      У гуртожитку проживають студенти юридичного факультету та сімейні працівники університету.
    `,
    adress: "м. Тернопіль, вул. Львівська, 7"
},
{
    name: "Гуртожиток №3",
    floors: 9,
    system: "блочна",
    description: `
      У кожному блоці 4 кімнати, санвузол, коридор. На кожному поверсі знаходиться дві кухні.
      На першому поверсі знаходиться кабінет завідувача, просторий вестибюль, пральна кімната.
      У гуртожитку проживають студенти факультету фінансів та обліку, факультету економіки та управління, соціально-гуманітраного факультету, навчально-наукового інституту біоресурсів і природокористування.
    `,
    adress: "м. Тернопіль, вул. Львівська, 3"
},
{
    name: "Гуртожиток №4",
    floors: 9,
    system: "блочна",
    description: `
      У кожному блоці 8 кімнат, санвузол, кухня та коридор.
      На першому поверсі знаходиться кабінет завідувача гуртожитку, просторий вестибюль, дві лекційні аудиторії, кабінет вихователя коледжу, дві пральні кімнати. У цокольному приміщенні гуртожитку – боксерський зал.
      У гуртожитку проживають студенти ВСП «Фаховий коледж економіки, права та інформаційних технологій ЗУНУ», соціально-гуманітраного факультету, факультету фінансів та обліку.
    `,
    adress: "м. Тернопіль, вул. Львівська, 4"
}  
];

async function start() {
homeData.forEach(async (element) => {
    const {name, floors, system, description, adress} = element
    await addHome(name, floors, system, description, adress)
})
console.log(await getAllHomes())
}
start()